rfbritto3769/placa_gravacao_sr_joao/grava_pic16f15344.c
/*
 * File:   grava_pic16f15344.c
 * Author: Rodrigo
 *
 * Created on 8 de Outubro de 2020, 08:07
 */


#include <xc.h>
#include "p24fj128ga006.h"
#include "define_gr.h"
#include "global_gr.h"
#include "PIC_Prog_16F.h"
////////////////////////////////////////////////////////////////////////////////
#define  ISP_CLK_DELAY  1
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
unsigned char p16c_enter_progmode(void)
	{
	PGC=false;
	PGD=false;
	VPP=OFF;
	Vpp_GND_ON();
	delay_50us(20);
	Vpp_GND_OFF();
	VPP=ON;
	delay_50us(30);//30
	if((ADCValueVpp<=380)||(ADCValueVpp>=590))//510))
		{
		VPP=OFF;
		Vpp_GND_ON();
		StatusGr=0xf7;			// Erro na tensão de gravação (VPP)
		return(1);
		}
	else
		return(0);
	}
////////////////////////////////////////////////////////////////////////////////
void isp_send_8_msb (unsigned char data)
{
unsigned char i;
PGD_DIR=true;		//output
TRISG=TrisGInit;
//_delay_us(3*ISP_CLK_DELAY);
for (i=0;i<8;i++)
  {
  if (data&0x80)//0x80
    {
      PGD=1;
    }
  else
    {
      PGD=0;
    }
  
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  
 //// delay_50us(ISP_CLK_DELAY);
  PGC=1;
  /////delay_50us(ISP_CLK_DELAY);
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  
  
  data = data << 1;
  PGC=0;
  PGD=0;
//  _delay_us(ISP_CLK_DELAY);
  }
}
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
void isp_send_24_msb (unsigned long data)
{
unsigned char i;
PGD_DIR=true;		//output
TRISG=TrisGInit;
//_delay_us(3*ISP_CLK_DELAY);
for (i=0;i<23;i++)
  {
  if (data&0x400000)
    {
      PGD=1;
    }
  else
    {
      PGD=0;
    }
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  
  PGC=1;
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();

  data = data << 1;
  PGC=0;
//  _delay_us(ISP_CLK_DELAY);
  }
  PGD=0;
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  

  PGC=1;
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();

  PGC=0;
}
////////////////////////////////////////////////////////////////////////////////
unsigned int isp_read_8_msb (void)
{
unsigned char i;
unsigned int out;
out = 0;
TRISG=TrisGInp;
PGD_DIR=false;		//input
//_delay_us(3*ISP_CLK_DELAY);
for (i=0;i<8;i++)
  {
    PGC=1;
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  
  
   PGC=0;
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  
  
  out = out << 1;
  if (PGD_IN)
    out = out | 0x1;
  }
PGD_DIR=true;		//output
TRISG=TrisGInit;
 return out;
}
////////////////////////////////////////////////////////////////////////////////
unsigned int isp_read_16_msb (void)
{
unsigned char i;
unsigned int out;
out = 0;
TRISG=TrisGInp;
PGD_DIR=false;		//input
//_delay_us(3*ISP_CLK_DELAY);
for (i=0;i<16;i++)
  {
   PGC=1;
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  
  
   PGC=0;
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  
  
  out = out << 1;
  if (PGD_IN)
    out = out | 0x1;
  }
PGD_DIR=true;		//output
TRISG=TrisGInit;
 return out;
}
////////////////////////////////////////////////////////////////////////////////


////////////////////////////////////////////////////////////////////////////////
void p16c_set_pc (unsigned long pc)
{
  isp_send_8_msb(0x80);
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  
  isp_send_24_msb(pc); 
 

}
////////////////////////////////////////////////////////////////////////////////
void p16c_bulk_erase (void)
{
  isp_send_8_msb(0x18);
  if(adapt_224==1)
  {
  delay_50us(150);//100
  }else
  {
  delay_50us(150);//100
  }
}
////////////////////////////////////////////////////////////////////////////////
void p16c_load_nvm (unsigned char inc, unsigned int data)
{
  if (inc==0) isp_send_8_msb(0x00);
  else isp_send_8_msb(0x02);
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  
 
  isp_send_24_msb(data);
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  

  }
////////////////////////////////////////////////////////////////////////////////
unsigned int p16c_read_data_nvm (unsigned char inc)
{
  unsigned int retval;
  unsigned char tmp;
  if (inc==0) isp_send_8_msb(0xFC);
  else isp_send_8_msb(0xFE);
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  NoP();
  
 
  tmp = isp_read_8_msb();
  retval = isp_read_16_msb();
  retval = retval >> 1;
  if (tmp&0x01) retval = retval | 0x8000;
  return retval;
  }
////////////////////////////////////////////////////////////////////////////////
void p16c_begin_prog (unsigned char cfg_bit)
{
  isp_send_8_msb(0xE0);
  delay_50us(55);  //60  10
  if (cfg_bit!=0) delay_50us(55); //60
  }
////////////////////////////////////////////////////////////////////////////////
unsigned int p16c_get_ID (void)
{
  p16c_set_pc(0x8006);
  return p16c_read_data_nvm(1);
  }
////////////////////////////////////////////////////////////////////////////////
void p16c_isp_write_pgm (unsigned int * data, unsigned long addr, unsigned char n)
{
unsigned char i;
//_delay_us(3*ISP_CLK_DELAY);
p16c_set_pc(addr);
for (i=0;i<n;i++)  
  p16c_load_nvm(1 , data[i]);  
p16c_set_pc(addr);
p16c_begin_prog(0);
}
////////////////////////////////////////////////////////////////////////////////
void p16c_isp_read_pgm (unsigned int * data, unsigned long addr, unsigned char n)
{
unsigned char i;
unsigned int tmp1,tmp2;
//_delay_us(3*ISP_CLK_DELAY);
p16c_set_pc(addr);
for (i=0;i<n;i++)  
  data[i] = p16c_read_data_nvm(1);
}
////////////////////////////////////////////////////////////////////////////////
void isp_inc_pointer (void)
{
//_delay_us(3*ISP_CLK_DELAY);
isp_send_8_msb(0xf8);
//isp_send(0xf8,6);
}
////////////////////////////////////////////////////////////////////////////////
void ExitWordMode344_1(void) 
	{
	PGC=false;
	PGD=false;
	delay_50us(10);
	VPP=OFF;
	Vpp_GND_OFF();
	delay_50us(10);
	}
////////////////////////////////////////////////////////////////////////////////
unsigned char EnterProgMode344_xx(void)
	{
	PGC=false;
	PGD=false;
	VPP=OFF;
	Vpp_GND_ON();
	delay_50us(20);
	Vpp_GND_OFF();
	VPP=ON;
	delay_50us(30);//30
	if((ADCValueVpp<=380)||(ADCValueVpp>=590))//510))
		{
		VPP=OFF;
		Vpp_GND_ON();
		StatusGr=0xf7;			// Erro na tensão de gravação (VPP)
		return(1);
		}
	else
		return(0);
	}
////////////////////////////////////////////////////////////////////////////////
void MontaHeader_1(unsigned char *linha) 
	{
	unsigned char index, i=0;
	
