rfbritto3769/placa_gravacao_sr_joao/grava_pic16f15344.c
	ClrWdt();

	ByteCount = CharToHex(*linha++) << 4;
	ByteCount |= CharToHex(*linha++);
	Address = (unsigned int)CharToHex(*linha++) << 12;
	Address |= (unsigned int)CharToHex(*linha++) << 8;
	Address |= (unsigned int)CharToHex(*linha++) << 4;
	Address |= (unsigned int)CharToHex(*linha++);
	RecordType = CharToHex(*linha++) << 4;
	RecordType |= CharToHex(*linha++);
	
	index = ByteCount;
	for(i=0;i<16;i++)
		DataHex[i]=0xff;
	i=0;

	while (index--) 
		{
		DataHex[i] = CharToHex(*linha++) << 4;
		DataHex[i] |= CharToHex(*linha++);
		i++;
		}
	}
////////////////////////////////////////////////////////////////////////////////
void MontaProg344_1(void)
	{
	volatile unsigned int datateste=0;
	unsigned char i=0;

	while(Endereco16F != Address) 
		{
		Endereco16F += 2;
		AddrProg++;
		if((AddrProg&0x07ff)==0x0000) //indice igual a 0x0800
			{
			ProgWord344_1();
//			for(datateste=0;datateste<2048;datateste++)
//				WordProg[datateste]=0x3fff;
//			datateste=0;
			}
		}
	Endereco16F += (unsigned int)ByteCount;

	while(ByteCount) 
		{
		datateste=(unsigned int)DataHex[i+1];
        //datateste=((DataHex[i+1]<<8)|(unsigned int)DataHex[i]);
		datateste=((datateste<<8)|(unsigned int)DataHex[i]);
        //datateste =((unsigned int)DataHex[i]<<8)|(unsigned int)DataHex[i+1];
      
		WordProg[(AddrProg&0x07ff)]=datateste;
        //WordProg[(AddrProg)]=datateste;
		ByteCount -= 2;
		i+=2;
		AddrProg++;
if(AddrProg>=0x670)//0x07e0)
{
NoP();
NoP();
NoP();
NoP();
NoP();
NoP();
}
		if((AddrProg&0x07ff)==0x0000) //indice igual a 0x0800
			{
			ProgWord344_1();
//			for(datateste=0;datateste<2048;datateste++)
//				WordProg[datateste]=0x3fff;
//			datateste=0;
			}
		}
	}
////////////////////////////////////////////////////////////////////////////////
void ProgWord344_1(void)
{
	unsigned char wordCount,BlockCount=64;
	unsigned int indice=0,maxdata;
    ////uint16_t seta_pc=0;
    
    PGC=false;
	PGD=false;
	if(SetVdd3v)
		Vdd_3V();		//Seta alimentação para 5V
	if(SetVdd5v)
		Vdd_5V();		//Seta alimentação para 5V
	Vpp_9V();			//seta VPP para 9V
	PGD_DIR=true;		//output
	Vpp_GND_OFF();		//desconecta VPP de GND
	VDD_GR=ON;			//liga alimentação
	delay_50us(500);	//400);
	
    EnterProgMode344_xx();
    
    
    
    
    
	Programado=true;
    p16c_set_pc(0x0000);//
     
    delay_50us(40);
	maxdata=AddrProg-1;
	if(maxdata>0x7ff)
		maxdata=maxdata-0x7ff;
	while((indice<=maxdata)&&BlockCount)  
	{
		wordCount=32;//32
		while(wordCount)
		{
//			if(WordProg[indice]!=0x3fff)
//                p16c_load_nvm (0,WordProg[indice]);
				//SendCommand_344(LOAD_DATA_PROG_MEM_344,WordProg[indice]);	// envia word
			wordCount--;
			if(wordCount)
            {
                p16c_load_nvm (1,WordProg[indice]);  
            }else
            {
                p16c_load_nvm (0,WordProg[indice]);  
            }
                ////isp_inc_pointer();
				//SendCommand_344(INCREMENT_ADDRESS_344,0);				// incrementa PC
                
			indice++;
		}
		//SendCommand_344(BEGIN_PROGRAMMING_344,0);						// grava as trinta e duas words
       ///// p16c_set_pc(seta_pc);
      ////  p16c_set_pc(0x0000);//
        p16c_begin_prog(0);
      
        ////seta_pc=seta_pc+32;
        isp_inc_pointer();
        
        ////delay_50us(1000);
		//SendCommand_344(INCREMENT_ADDRESS_344,0);						// incrementa PC
		BlockCount--;
	}
    
    ExitProgMode344_1();
	delay_50us(10);
	VDD_GR=false;
}
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
unsigned char VerifyProgMem344_1(void)
	{
	unsigned char i=0,ix=0;
	volatile unsigned int datateste, AddrFinal, datarec;
    
    
    PGC=false;
	PGD=false;
	if(SetVdd3v)
		Vdd_3V();		//Seta alimentação para 5V
	if(SetVdd5v)
		Vdd_5V();		//Seta alimentação para 5V
	Vpp_9V();			//seta VPP para 9V
	PGD_DIR=true;		//output
	Vpp_GND_OFF();		//desconecta VPP de GND
	VDD_GR=ON;			//liga alimentação
	delay_50us(500);	//400);
	
    EnterProgMode344_xx();
    
    

	StatusGr=0x03;			// Verificando gravação

	//// britto SendCommand(RESET_ADDRESS,0);				// reset PC
    p16c_set_pc(0x0000);
	AddrFinal=Endereco16F;
	Endereco16F=0;
	do
		{
		MemoryReadSector(Endereco,MemoryBuffer);		// le 512 byte da memoria
		Endereco+=512;
		IndexBuffer=0;
		if(MemoryBuffer[IndexBuffer]==':'&&i==0)
			IndexBuffer++;
		while(IndexBuffer<512&&(Endereco16F<AddrFinal))
			{
			do
				{
				BufferLine[i]=MemoryBuffer[IndexBuffer];
				i++;
				IndexBuffer++;
				}while (MemoryBuffer[IndexBuffer]!=':'&&IndexBuffer<512);
				
			if(MemoryBuffer[IndexBuffer]==':')
				{
				IndexBuffer++;
				i=0;
				ix=0;
				MontaHeader_1(BufferLine);
				if(RecordType==0x00)
					{
					if(Address != 0x400E)
						{
						while(Endereco16F != Address) 
							{
							Endereco16F += 2;
							//SendCommand_344(INCREMENT_ADDRESS_344,0);				// incrementa PC
                            isp_inc_pointer();
							}
							
						Endereco16F += (unsigned int)ByteCount;
						
						while(ByteCount) 
							{
							datateste=(unsigned int)DataHex[ix+1];
							datateste=((datateste<<8)|(unsigned int)DataHex[ix]);
							datarec = p16c_read_data_nvm(0);//SendCommand_344(READ_DATA_PROG_MEM_344,0);
                            /////p16c_isp_read_pgm (&datarec, &datateste, 1);
							if(datateste!=datarec)	//
								{
								StatusGr=0xf3;			// Erro na gravação
								return(1);
								}
							//SendCommand_344(INCREMENT_ADDRESS_344,0);				// incrementa PC
                            isp_inc_pointer();
							ix+=2;
							ByteCount -= 2;
							}
						}
					else
						return 0;
					}
				}
			}
		}while(Endereco16F<AddrFinal);
        
//    ExitProgMode344_1();
//	delay_50us(10);
//	VDD_GR=false;
    
	return 0;
	}
////////////////////////////////////////////////////////////////////////////////
void ProgConfigMem344_1(void)
{
	volatile unsigned int datateste, datarec;
    
    
//    PGC=false;
//	PGD=false;
//	if(SetVdd3v)
//		Vdd_3V();		//Seta alimentação para 5V
//	if(SetVdd5v)
//		Vdd_5V();		//Seta alimentação para 5V
//	Vpp_9V();			//seta VPP para 9V
//	PGD_DIR=true;		//output
//	Vpp_GND_OFF();		//desconecta VPP de GND
//	VDD_GR=ON;			//liga alimentação
//	delay_50us(500);	//400);
//	
//    EnterProgMode344_xx();
	//// britto SendCommand(LOAD_CONFIGURATION,0);			// PC > 0x8000

    p16c_set_pc(0x8007);

