rfbritto3769/placa_gravacao_sr_joao/grava_pic16f15344.c
	datateste=(unsigned int)DataHex[1];
	datateste=((datateste<<8)|(unsigned int)DataHex[0]);
	datateste=datateste&0x3fff;
	//SendCommand_344(LOAD_DATA_PROG_MEM_344,datateste);	// primeira word
    p16c_load_nvm (0 ,datateste);
	//SendCommand_344(BEGIN_PROGRAMMING_344,0);			// grava word de configuração 1
    p16c_begin_prog(1);
    delay_50us(20);//10);
	datarec=p16c_read_data_nvm(0);//SendCommand_344(READ_DATA_PROG_MEM_344,0);
   
	if(datateste!=datarec)
		StatusGr=0xf4;							// Erro de gravação
    isp_inc_pointer();
	//SendCommand_344(INCREMENT_ADDRESS_344,0);			// incrementa PC > 0x8008
	datateste=0x3f;//(unsigned int)DataHex[3];					/****** ????? ******/
	datateste=((datateste<<8)|0xe6);/****** ????? ******///((datateste<<8)|(unsigned int)DataHex[2])
	datateste=datateste&0x3fff;
	////datateste=datateste|0x08fc;
    p16c_load_nvm (0 , datateste);
	//SendCommand_344(LOAD_DATA_PROG_MEM_344,datateste);	// segunda word
	//SendCommand_344(BEGIN_PROGRAMMING_344,0);			// grava word de configuração 2
    p16c_begin_prog(1);
	delay_50us(20);//10);
	datarec= p16c_read_data_nvm(0);//SendCommand_344(READ_DATA_PROG_MEM_344,0);
	if(datateste!=datarec)
		StatusGr=0xf4;							// Erro de gravação
////	else
////		StatusGr=0x04;							// Gravação OK
    
    isp_inc_pointer();
	//SendCommand_344(INCREMENT_ADDRESS_344,0);			// incrementa PC > 0x8009
	datateste=(unsigned int)DataHex[5];					/****** ????? ******/
	datateste=((datateste<<8)|(unsigned int)DataHex[4]);/****** ????? ******/
	datateste=datateste&0x3fff;
	////datateste=datateste|0x08fc;
    p16c_load_nvm (0 , datateste);
	//SendCommand_344(LOAD_DATA_PROG_MEM_344,datateste);	// segunda word
	//SendCommand_344(BEGIN_PROGRAMMING_344,0);			// grava word de configuração 2
    p16c_begin_prog(1);
	delay_50us(20);//10);
	datarec= p16c_read_data_nvm(0);//SendCommand_344(READ_DATA_PROG_MEM_344,0);
	if(datateste!=datarec)
		StatusGr=0xf4;							// 
    
    isp_inc_pointer();
	//SendCommand_344(INCREMENT_ADDRESS_344,0);			// incrementa PC > 0x800A
	datateste=0x1f;(unsigned int)DataHex[7];					/****** ????? ******/
	datateste=((datateste<<8)|0xff);/****** ????? ******///((datateste<<8)|(unsigned int)DataHex[6]);
	datateste=datateste&0x3fff;
	////datateste=datateste|0x08fc; britto 10022022
    p16c_load_nvm (0 , datateste);
	//SendCommand_344(LOAD_DATA_PROG_MEM_344,datateste);	// segunda word
	//SendCommand_344(BEGIN_PROGRAMMING_344,0);			// grava word de configuração 2
    p16c_begin_prog(1);
	delay_50us(20);//10);
	datarec= p16c_read_data_nvm(0);//SendCommand_344(READ_DATA_PROG_MEM_344,0);
    if(datateste!=datarec)
		StatusGr=0xf4;	
    
    
     isp_inc_pointer();
	//SendCommand_344(INCREMENT_ADDRESS_344,0);			// incrementa PC > 0x8009
	datateste=0xff;					/****** ????? ******/
	datateste=((datateste<<8)|0xff);/****** ????? ******/
	datateste=datateste&0x3fff;
	////datateste=datateste|0x08fc;
    p16c_load_nvm (0 , datateste);
	//SendCommand_344(LOAD_DATA_PROG_MEM_344,datateste);	// segunda word
	//SendCommand_344(BEGIN_PROGRAMMING_344,0);			// grava word de configuração 2
    p16c_begin_prog(1);
	delay_50us(20);//10);
	datarec= p16c_read_data_nvm(0);//SendCommand_344(READ_DATA_PROG_MEM_344,0);
	if(datateste!=datarec)
    {
        StatusGr=0xf4;	}
    else {
        StatusGr=0x04;
        }
    
    ExitProgMode344_1();
	delay_50us(10);
	VDD_GR=false;
}
////////////////////////////////////////////////////////////////////////////////
void ProgData344_1(void)
{
	unsigned int datarec, addr, datateste=0;
	addr=(Address&0x0fff)/2;
	unsigned char i=0;
		
	while(ByteCount) 
	{
		datateste=(unsigned int)DataHex[i+1];
		datateste=((datateste<<8)|(unsigned int)DataHex[i]);
		WordProg[(AddrProg&0x07ff)]=datateste;
		ByteCount -= 2;
		i+=2;
		//// britto SendCommand(LOAD_DATA_DATA_MEM,datateste);	// envia word
		//SendCommand_344(BEGIN_PROGRAMMING_344,0);			// grava byte na EEPROM
        p16c_load_nvm (0 , datateste);
         p16c_begin_prog(0);
		///// brittodatarec=SendCommand(READ_DATA_DATA_MEM,0);	
		if(datateste!=datarec)	//
		{
			StatusGr=0xf9;			// Erro na gravação
			return(1);
		}
//		//SendCommand_344(INCREMENT_ADDRESS_344,0);					// incrementa PC
        isp_inc_pointer();
	}
}
////////////////////////////////////////////////////////////////////////////////
void ExitProgMode344_1(void) 
	{
	PGC=false;
	PGD=false;
	delay_50us(10);
	VPP=OFF;
	Vpp_GND_OFF();
	delay_50us(10);
       
//ISP_MCLR_1
//_delay_ms(30);
//ISP_MCLR_0
//_delay_ms(30);
//ISP_MCLR_1
	}

////////////////////////////////////////////////////////////////////////////////
void grava_pic16f15344(void)
{
    unsigned int addr,data_rec;
	unsigned char ret=0;
    unsigned int teste_data;
    
    unsigned char i=0,a,b,c,d,ee,ff,gg,hh,ii,jj,AddrExtend=0;
	volatile unsigned int testex=0;
	
    
    
   	ContByteProg=0;
	AddrData=0;
	StatusGr=0x01;		// Apagando
	PGC=false;
	PGD=false;
	if(SetVdd3v)
		Vdd_3V();		//Seta alimentação para 5V
	if(SetVdd5v)
		Vdd_5V();		//Seta alimentação para 5V
	Vpp_9V();			//seta VPP para 9V
	PGD_DIR=true;		//output
	Vpp_GND_OFF();		//desconecta VPP de GND
	VDD_GR=ON;			//liga alimentação
	delay_50us(500);	//400);
	if(SetVdd3v)
	{
		if((ADCValueVdd<=200)||(ADCValueVdd>=250))
		{
			VDD_GR=OFF;		//desliga alimentação
			StatusGr=0xf6;	// Erro na tensão de alimentação (VDD)
			ret=0xff;
		}
	}
	else
	{
		if((ADCValueVdd<=200)||(ADCValueVdd>=350))
		{
			VDD_GR=OFF;		//desliga alimentação
			StatusGr=0xf6;	// Erro na tensão de alimentação (VDD)
			ret=0xff;
		}
	}
    EnterProgMode344_xx();
    
 
//    data_rec = p16c_get_ID();
//    p16c_set_pc(0x8007);
//    data_rec = p16c_read_data_nvm(1);
    
     p16c_set_pc(0x0000);
     p16c_bulk_erase();
     
     
//    
//   //// p16c_isp_read_pgm (&data_rec, 0x10, 1);
//    		for(addr=0;addr<=MaxMemory;addr++)
//			{
//			//p16c_isp_read_pgm (&data_rec, 0, 1);
//            p16c_isp_read_pgm (&data_rec, addr, 1);
//	
//            if(data_rec!=0x3fff)
//				{
//				StatusGr=0xf1;			// Erro no apagamento
//				return(1);//1
//				}
//			
//			}
    

    
    
