rfbritto3769/placa_gravacao_sr_joao/grava_pic16f15344.c
    delay_50us(1000);
    
    p16c_set_pc(0x8000);
    p16c_bulk_erase();
    
    
    delay_50us(1000);
    
    p16c_set_pc(0x80fe);
    p16c_bulk_erase();
    
    delay_50us(1000);
    
    p16c_set_pc(0xe800);
    p16c_bulk_erase();
    
    
    StatusGr=0xf4;
    delay_50us(1000);
    
    ExitProgMode344_1();
	delay_50us(10);
	VDD_GR=false;
    
////////teste escrita na flash do target    
//    uint32_t p = 0x0000;
//    uint8_t size=64;
//    unsigned int dado1 = 0x1111;
//    unsigned int dado[64]={0x1,0x2,0x3,0x4,0x5,0x6,0x7,0x8,0x9,0xa,0x1,0x2,0x3,0x4,0x5,0x6,0x7,0x8,0x9,0xa,0x1,0x2,0x3,0x4,0x5,0x6,0x7,0x8,0x9,0xa,0x0b,0x0c,0x1,0x2,0x3,0x4,0x5,0x6,0x7,0x8,0x9,0xa,0x1,0x2,0x3,0x4,0x5,0x6,0x7,0x8,0x9,0xa,0x1,0x2,0x3,0x4,0x5,0x6,0x7,0x8,0x9,0xa,0x0b,0x0c};
//   
//    p16c_set_pc(0x0000);
//  //  p16c_isp_write_pgm(dado,p,size);
//    for(p=0;p<=size;p++)
//    {
//      //  isp_inc_pointer();
//       
//        p16c_load_nvm(1,dado1); 
//         
//    }
//
//     p16c_set_pc(0x0000);
//     p16c_begin_prog(0);
//    
//   delay_50us(100);
//    p16c_set_pc(0x0000);
//    for(addr=0;addr<=size;addr++)
//			{
//			p16c_isp_read_pgm (&teste_data, addr, 1);
//            if(teste_data!=0x0000)
//            {
//                StatusGr=0xf1;		
//			////	return(1);//1
//            }
//	}
//    
//    ExitProgMode344_1();
//	delay_50us(10);
//	VDD_GR=false;
//    
//    while(1);//////////
    		
       //// SendCommand_344(LOAD_PC_344,0);
     if(!ret)
	{
       ///////// p16c_set_pc(0x0000);
		Endereco=EnderecoBase;
		StatusGr=0x02;			// Gravação em andamento
		RecordType = 0;
		Endereco16F=0;
		for(AddrProg=0;AddrProg<2048;AddrProg++)
			WordProg[AddrProg]=0x3fff;
		AddrProg=0;
		do
		{
			MemoryReadSector(Endereco,MemoryBuffer);		// le 512 byte da memoria
			Endereco+=512;
			IndexBuffer=0;
			if(MemoryBuffer[IndexBuffer]==':'&&i==0)
				IndexBuffer++;
			while(IndexBuffer<512&&!ret&&!AbortaGr)
			{
				if(MemoryBuffer[IndexBuffer]!=':')
				{
					do											
					{
						BufferLine[i]=MemoryBuffer[IndexBuffer];
						i++;
						IndexBuffer++;
					}while (MemoryBuffer[IndexBuffer]!=':'&&IndexBuffer<512);
				}
				if(MemoryBuffer[IndexBuffer]==':')
				{
					IndexBuffer++;
					i=0;
					MontaHeader_1(BufferLine);
					if(RecordType==0x00&&!AddrExtend)
					{
						MontaProg344_1();
					}
					else 
                        if(RecordType==0x04&&!AddrExtend)
					{
						if(!Programado)
						{
							ProgWord344_1();
							if(Address==0)
							{
								for(testex=0;testex<2048;testex++)
									WordProg[testex]=0x3fff;
							}
						}
						AddrExtend=DataHex[1];
					}
					else 
                        if(AddrExtend && RecordType==0x00&&Address>=0xe000&&Address<=0xe1ff) 		ProgData344_1();
					else 
                        if(AddrExtend&&RecordType==0x00&&Address==0x000e)
					{
						Endereco=EnderecoBase;
						delay_50us(10);
						a=DataHex[0];
						b=DataHex[1];
						c=DataHex[2];
						d=DataHex[3];
                        ee = DataHex[4];
                        ff = DataHex[5];
                        gg = DataHex[6];
                        hh = DataHex[7];
                        ii = DataHex[8];
                        jj = DataHex[9];
					   ret=VerifyProgMem344_1();
						if(!ret&&!AbortaGr)
							{
							DataHex[0]=a;
							DataHex[1]=b;
							DataHex[2]=c;
							DataHex[3]=d;
                            ee = DataHex[4];
                            ff = DataHex[5];
                            gg = DataHex[6];
                            hh = DataHex[7];
                            ii = DataHex[8];
                            jj = DataHex[9];
							ProgConfigMem344_1();
							}
						ExitProgMode344_1();
						delay_50us(10);
						VDD_GR=false;
						ret=1;
				}
                }
			}
		}while(RecordType!=0x01&&!ret&&!AbortaGr);
    }
//	AbortaGr=false;
//	ExitProgMode344_1();
//	Programado=false;
//	PGD_DIR=false;			//hightZ      
//	VDD_GR=OFF;
    
}